In [4]:
a = [1,2,3]
b=[4,5,6]
for a,b in zip(a,b):
    print(a*b)

4
10
18

In [9]:
ss = [['xx','m',22],['cc','w',33],['jj','w',44],['qq','m',11]]
import pandas as pd
df = pd.DataFrame(ss)
df.columns=['name','gender','age']
df

  name gender  age
0   xx      m   22
1   cc      w   33
2   jj      w   44
3   qq      m   11

In [11]:
phone = pd.Series([21000,18900,18000])
phone

0    21000
1    18900
2    18000
dtype: int64

In [13]:
phone = pd.Series([21000,18900,18000],index=['iphone7','oppo','sunsumg'])
phone

iphone7    21000
oppo       18900
sunsumg    18000
dtype: int64

In [15]:
phone[1]

18900

In [17]:
phone[1:3]

oppo       18900
sunsumg    18000
dtype: int64

In [19]:
phone['oppo']

18900

In [21]:
ss = [['xx','m',22],['cc','w',33],['jj','w',44],['qq','m',11]]
import pandas as pd
df = pd.DataFrame(ss)
df.columns=['name','gender','age']
df

  name gender  age
0   xx      m   22
1   cc      w   33
2   jj      w   44
3   qq      m   11

In [23]:
df.head(3)

  name gender  age
0   xx      m   22
1   cc      w   33
2   jj      w   44

In [25]:
df.tail(3)

  name gender  age
1   cc      w   33
2   jj      w   44
3   qq      m   11

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
name      4 non-null object
gender    4 non-null object
age       4 non-null int64
dtypes: int64(1), object(2)
memory usage: 176.0+ bytes

In [29]:
df.describe()

             age
count   4.000000
mean   27.500000
std    14.200939
min    11.000000
25%    19.250000
50%    27.500000
75%    35.750000
max    44.000000

In [31]:
df.ix[1:4]

  name gender  age
1   cc      w   33
2   jj      w   44
3   qq      m   11

In [34]:
df['name']

0    xx
1    cc
2    jj
3    qq
Name: name, dtype: object

In [36]:
df[['name','age']]

  name  age
0   xx   22
1   cc   33
2   jj   44
3   qq   11

In [39]:
df.ix[1:2,['name','age']]

  name  age
1   cc   33
2   jj   44

In [1]:
?df.ix

Object `df.ix` not found.

In [43]:
df.gender

0    m
1    w
2    w
3    m
Name: gender, dtype: object

In [46]:
df['gender']

0    m
1    w
2    w
3    m
Name: gender, dtype: object

In [48]:
df['gender']=='m'

0     True
1    False
2    False
3     True
Name: gender, dtype: bool

In [50]:
df[df['gender']=='m']

  name gender  age
0   xx      m   22
3   qq      m   11

In [54]:
df[df['age']>30]

  name gender  age
1   cc      w   33
2   jj      w   44

In [59]:
df[(df['gender']=='m')&(df['age']>20)]

  name gender  age
0   xx      m   22

In [61]:
df[(df['gender']=='m')|(df['age']>20)]

  name gender  age
0   xx      m   22
1   cc      w   33
2   jj      w   44
3   qq      m   11

In [65]:
df['enployee']=True
df

  name gender  age enployee
0   xx      m   22     True
1   cc      w   33     True
2   jj      w   44     True
3   qq      m   11     True

In [68]:
del df['enployee']

KeyError: 'enployee'

In [70]:
df

  name gender  age
0   xx      m   22
1   cc      w   33
2   jj      w   44
3   qq      m   11

In [72]:
df['enployee']=True

In [75]:
df = df.drop('enployee',axis=1)

ValueError: labels ['enployee'] not contained in axis

In [77]:
df

  name gender  age
0   xx      m   22
1   cc      w   33
2   jj      w   44
3   qq      m   11

In [80]:
df.loc[3]

name      qq
gender     m
age       11
Name: 3, dtype: object

In [84]:
df.loc[4]={'name':'qoo','age':20,'gender':'m'}

In [86]:
df

  name gender age
0   xx      m  22
1   cc      w  33
2   jj      w  44
3   qq      m  11
4  qoo      m  20

In [88]:
df = df.drop(4)
df

ValueError: labels [4] not contained in axis

In [90]:
df = df.append(pd.DataFrame([{'name':'qoo','age':20,'gender':'m'}]),ignore_index=True)

In [92]:
df

  age gender name
0  22      m   xx
1  33      w   cc
2  44      w   jj
3  11      m   qq
4  20      m  qoo
5  20      m  qoo

In [95]:
df = df.drop(5)

ValueError: labels [5] not contained in axis

In [106]:
df['userid']=range(101,106)

In [108]:
df.set_index('userid',inplace=True)

KeyError: 'userid'

In [110]:
df.iloc[1]

age       33
gender     w
name      cc
Name: 102, dtype: object

In [112]:
df.iloc[[1,3,4]]

       age gender name
userid
102     33      w   cc
104     11      m   qq
105     20      m  qoo

In [114]:
df.ix[[101,103,104]]

       age gender name
userid
101     22      m   xx
103     44      w   jj
104     11      m   qq

In [116]:
df.loc[[102,103,105]]

       age gender name
userid
102     33      w   cc
103     44      w   jj
105     20      m  qoo

In [118]:
import numpy as np
import pandas as pd

In [120]:
df = pd.DataFrame([['frank','m',np.nan],['mary',np.nan,np.nan],['tom','m',35],['ted','m',33],['jean',np.nan,21],['lisa','f',20]])

In [121]:
df.columns=['name','gender','age']

In [142]:
df

    name gender   age
0  frank      m   NaN
1   mary    NaN   NaN
2    tom      m  35.0
3    ted      m  33.0
4   jean    NaN  21.0
5   lisa      f  20.0

In [126]:
df['gender'].notnull()

0     True
1    False
2     True
3     True
4    False
5     True
Name: gender, dtype: bool

In [129]:
df['age'].isnull().values.any()

True

In [132]:
df.isnull().values.any()

True

In [134]:
df['age'].isnull().sum()

2

In [138]:
df.isnull().sum().sum()

4

In [140]:
df.dropna()

   name gender   age
2   tom      m  35.0
3   ted      m  33.0
5  lisa      f  20.0

In [145]:
df.dropna(how='all')

    name gender   age
0  frank      m   NaN
1   mary    NaN   NaN
2    tom      m  35.0
3    ted      m  33.0
4   jean    NaN  21.0
5   lisa      f  20.0

In [148]:
df.dropna(thresh=2)

    name gender   age
0  frank      m   NaN
2    tom      m  35.0
3    ted      m  33.0
4   jean    NaN  21.0
5   lisa      f  20.0

In [150]:
df['employee']=np.nan
df

    name gender   age  employee
0  frank      m   NaN       NaN
1   mary    NaN   NaN       NaN
2    tom      m  35.0       NaN
3    ted      m  33.0       NaN
4   jean    NaN  21.0       NaN
5   lisa      f  20.0       NaN

In [152]:
df.dropna(how='all',axis=1)

    name gender   age
0  frank      m   NaN
1   mary    NaN   NaN
2    tom      m  35.0
3    ted      m  33.0
4   jean    NaN  21.0
5   lisa      f  20.0

In [154]:
df

    name gender   age  employee
0  frank      m   NaN       NaN
1   mary    NaN   NaN       NaN
2    tom      m  35.0       NaN
3    ted      m  33.0       NaN
4   jean    NaN  21.0       NaN
5   lisa      f  20.0       NaN

In [156]:
df.fillna(0)

    name gender   age  employee
0  frank      m   0.0       0.0
1   mary      0   0.0       0.0
2    tom      m  35.0       0.0
3    ted      m  33.0       0.0
4   jean      0  21.0       0.0
5   lisa      f  20.0       0.0

In [158]:
df['age'].fillna(df['age'].mean())

0    27.25
1    27.25
2    35.00
3    33.00
4    21.00
5    20.00
Name: age, dtype: float64

In [161]:
df['age'].fillna(df.groupby('gender')['age'].transform('mean'),inplace=True)

In [163]:
df

    name gender   age  employee
0  frank      m  34.0       NaN
1   mary    NaN   NaN       NaN
2    tom      m  35.0       NaN
3    ted      m  33.0       NaN
4   jean    NaN  21.0       NaN
5   lisa      f  20.0       NaN

In [165]:
df.fillna(method='pad')

    name gender   age  employee
0  frank      m  34.0       NaN
1   mary      m  34.0       NaN
2    tom      m  35.0       NaN
3    ted      m  33.0       NaN
4   jean      m  21.0       NaN
5   lisa      f  20.0       NaN

In [168]:
df.fillna(method='bfill',limit=2)

    name gender   age  employee
0  frank      m  34.0       NaN
1   mary      m  35.0       NaN
2    tom      m  35.0       NaN
3    ted      m  33.0       NaN
4   jean      f  21.0       NaN
5   lisa      f  20.0       NaN

In [171]:
df2 = pd.DataFrame([[1,870],[2,900],[np.nan,np.nan],[4,950],[5,1080],[6,1200]])
df2.columns=['time','val']
df2

   time     val
0   1.0   870.0
1   2.0   900.0
2   NaN     NaN
3   4.0   950.0
4   5.0  1080.0
5   6.0  1200.0

In [172]:
df2.interpolate()

   time     val
0   1.0   870.0
1   2.0   900.0
2   3.0   925.0
3   4.0   950.0
4   5.0  1080.0
5   6.0  1200.0